In [1]:
data = {
    "a":[1,2,3],
    "b":[4,5,6],
    "c":["sudh","kumar","reddy"]
}

In [2]:
data

{'a': [1, 2, 3], 'b': [4, 5, 6], 'c': ['sudh', 'kumar', 'reddy']}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(data)

In [5]:
df

   a  b      c
0  1  4   sudh
1  2  5  kumar
2  3  6  reddy

In [6]:
df.set_index("c")

       a  b
c
sudh   1  4
kumar  2  5
reddy  3  6

In [7]:
df.set_index("c",inplace=True)

In [8]:
df

       a  b
c
sudh   1  4
kumar  2  5
reddy  3  6

In [9]:
df.reset_index()

       c  a  b
0   sudh  1  4
1  kumar  2  5
2  reddy  3  6

In [10]:
data = {
    "a":[1,2,3],
    "b":[4,5,6],
    "c":["sudh","kumar","reddy"]
}

df1 = pd.DataFrame(data,index=["x","y","z"])

In [11]:
df1

   a  b      c
x  1  4   sudh
y  2  5  kumar
z  3  6  reddy

In [12]:
# `df1.loc["x"]` is accessing the row with the label "x" in the DataFrame `df1`.
df1.loc["x"]

a       1
b       4
c    sudh
Name: x, dtype: object

In [13]:
df1

   a  b      c
x  1  4   sudh
y  2  5  kumar
z  3  6  reddy

In [14]:
df1.reindex(['y','x','z'])

   a  b      c
y  2  5  kumar
x  1  4   sudh
z  3  6  reddy